do

function run(msg, matches)

local mods = [[ 
🌟لیست دستورات سوپر گروه🌟:
➿شما کمک مالک هستید➿

💗(اینفو)💗
نمایش اطلاعات اصلی گروه

💗(ادمین ها)💗
نمایش لیست ادمین های گروه

💗(مالک)💗
نمایش خریدار گروه

💗(لیست مدیران)💗
نمایش لیست ناظم ها

💗(ربات ها)💗
لیست روبات های گروه

💗(ایدی افراد)💗
لیست اعضای گروه در یک فایل متنی

💗(بلاک)💗
بلاک کردن و کیک کردن فرد

🌠(ای دی)🌠
نمایش ایدی گروه
شما همچنین میتوانید هم با (یوزرنیم)و هم با (ریپلای پیام) ایدی عددی شخصی را بگیرید

💞(ایدی این)💞
نمایش اطلاعات فردی که پیغام رو فوارد کرده

💞(خروج)💞
اخراج شدن از سوپر گروه

💞(تنظیم مالک)💞
تنظیم کردن کاربر به عنوان خریدار گروه

🔴(ترفیع) [یوزرنیم][ریپلای پیام][ایدی]
🔵اضافه کردن کاربر به لیست ناظم ها

🔵(تنزل)[یوزرنیم][ایدی]🔴
پاک کردن کاربر از لیست ناظم ها

🔵(تنظیم نام)🔴
گذاشتن اسم گروه

🔴(تنظیم عکس)🔵
گذاشتن عکس برای گروه

🔴(تنظیم قوانین)🔵
گذاشتن قوانین برای گروه

🔴(تنظیم توضیحات)🔵
گذاشتن متن درباره برای سوپر گروه(این متن در بخش توضیحات گروه هم نمایش داده میشه)

🔴(ذخیره)[متن]🔵
ذخیره کردن یک متن

🔴(گرفتن)[متن]🔵
گرفتن متن

🔴(لینک جدید)🔵
ساختن لینک جدید

🔵(لینک)🔴
گرفتن لینک

🔵(قوانین)🔴
نمایش قوانین

🔴(تبدیل) ff🔵
تبدیل حروف با کلمه انگلیسی به عکس

💠قفل [لینک][اتک][اسپم][عربی][ورود][rtl][استیکر][محکم]💠

قفل کردن لینک گروها-اسپم-متن و اسم های بزرگ -زبان فارسی-تعداد اعضا-کاراکتر های غیر عادی-استیکر-مخاطبین
دقت کنید اگر گذینه اخری محکم روشن باشد کاربر از گروه کیک میشود و پیغام پاک میشه در غیر این صورت فقط پیغام پاک میشود

💠بازکردن [لینک][اتک][اسپم][عربی][ورود][rtl][استیکر][محکم]💠

باز کردن قفل امکانات بالا

💠(بستن)[اهنگ][عکس][گیف][ویدیو][فایل][چت]💠
پاک کردن سریع همه پیغام هایا چت ها-عکس ها-گیف ها-صدا های ضبط شده و موزیک-ویدیو

💠(ازاد کردن)[اهنگ][عکس][گیف][ویدیو][فایل][چت]💠
باز کردن قفل امکانات بالا

💠(حساسیت)[1_40]💠
گذاشتن value به عنوان حساسیت اسپم

🌟(تنظیمات)🌟
نمایش تنظیمات گروه

🌟(لیست ممنوع)🌟
نمایش نوع پیغام های سایلنت شده

🌟(ممنوع چت) [یورزنیم]🌟
سایلنت کردن یک کاربر خاص در گروه
فقط خریدار میتونه کسیو سایلنت کنه ولی ناظم ها میتونند فرد را از سایلنتی در بیاورند

🌟(لیست ممنوع)🌟
نمایش لیست افراد سایلنت شده

🌟(حذف)[قوانین][توضیحات][ مدیران][لیست ممنوع]🌟
پاک کردن لیست ناظم ها یا مدیران-توضیحات-لیست سایلنت شده ها یا لیست ممنوع-قوانین


🌟(عمومی) [yes|no]🌟
نمایش گروه شما در لیست گروها
فقط برای ادمین ها و سودو ها

🌟(ایدی) [یوزرنیم]🌟
گرفتن اطلاعت یوزر نیم داده شد

🌟!log🌟
برگرداندن تاریخچه گروه در یک فایل متنی
🔴🔵🔴🔵🔴🔵🔴🔵🔴🔵🔴🔵
نیازی نیست از اسلش/مربع/علامت تعجب در اول دستورات استفاده کنید
💗💗💗💗💗💗💗💗💗💗💗💗
فقط ادمین ها میتونن اعضا به گروه ادد کنند در سوپر گروه(قانون تلگرام)
💗💗💗💗💗💗💗💗💗💗💗💗
فقط ناظم ها و خریدار ها میتوانند دستورات  بالا را اجرا کنند
💗💗💗💗💗💗💗💗💗💗💗💗
فقط خریدار گروه میتواند دستورات بالا رو اجرا کند
💗💗💗💗💗💗💗💗💗💗💗💗
➿➿➿➿➿➿➿➿➿➿➿➿  

 ]]

 
 local admin = [[ 
 
🌟لیست دستورات سوپر گروه🌟:
🔻🔺شما ادمین ربات هستید🔺🔻

💗(اینفو)💗
نمایش اطلاعات اصلی گروه

💗(ادمین ها)💗
نمایش لیست ادمین های گروه

💗(مالک)💗
نمایش خریدار گروه

💗(لیست مدیران)💗
نمایش لیست ناظم ها

💗(ربات ها)💗
لیست روبات های گروه

💗(ایدی افراد)💗
لیست اعضای گروه در یک فایل متنی

💗(بلاک)💗
بلاک کردن و کیک کردن فرد

🌠(ای دی)🌠
نمایش ایدی گروه
شما همچنین میتوانید هم با (یوزرنیم)و هم با (ریپلای پیام) ایدی عددی شخصی را بگیرید

💞(ایدی این)💞
نمایش اطلاعات فردی که پیغام رو فوارد کرده

💞(خروج)💞
اخراج شدن از سوپر گروه

💞(تنظیم مالک)💞
تنظیم کردن کاربر به عنوان خریدار گروه

🔴(ترفیع) [یوزرنیم][ریپلای پیام][ایدی]
🔵اضافه کردن کاربر به لیست ناظم ها

🔵(تنزل)[یوزرنیم][ایدی]🔴
پاک کردن کاربر از لیست ناظم ها

🔵(تنظیم نام)🔴
گذاشتن اسم گروه

🔴(تنظیم عکس)🔵
گذاشتن عکس برای گروه

🔴(تنظیم قوانین)🔵
گذاشتن قوانین برای گروه

🔴(تنظیم توضیحات)🔵
گذاشتن متن درباره برای سوپر گروه(این متن در بخش توضیحات گروه هم نمایش داده میشه)

🔴(ذخیره)[متن]🔵
ذخیره کردن یک متن

🔴(گرفتن)[متن]🔵
گرفتن متن

🔴(لینک جدید)🔵
ساختن لینک جدید

🔵(لینک)🔴
گرفتن لینک

🔵(قوانین)🔴
نمایش قوانین

🔴(تبدیل) ff🔵
تبدیل حروف با کلمه انگلیسی به عکس

💠قفل [لینک][اتک][اسپم][عربی][ورود][rtl][استیکر][محکم]💠

قفل کردن لینک گروها-اسپم-متن و اسم های بزرگ -زبان فارسی-تعداد اعضا-کاراکتر های غیر عادی-استیکر-مخاطبین
دقت کنید اگر گذینه اخری محکم روشن باشد کاربر از گروه کیک میشود و پیغام پاک میشه در غیر این صورت فقط پیغام پاک میشود

💠بازکردن [لینک][اتک][اسپم][عربی][ورود][rtl][استیکر][محکم]💠

باز کردن قفل امکانات بالا

💠(بستن)[اهنگ][عکس][گیف][ویدیو][فایل][چت]💠
پاک کردن سریع همه پیغام هایا چت ها-عکس ها-گیف ها-صدا های ضبط شده و موزیک-ویدیو

💠(ازاد کردن)[اهنگ][عکس][گیف][ویدیو][فایل][چت]💠
باز کردن قفل امکانات بالا

💠(حساسیت)[1_40]💠
گذاشتن value به عنوان حساسیت اسپم

🌟(تنظیمات)🌟
نمایش تنظیمات گروه

🌟(لیست ممنوع)🌟
نمایش نوع پیغام های سایلنت شده

🌟(ممنوع چت) [یورزنیم]🌟
سایلنت کردن یک کاربر خاص در گروه
فقط خریدار میتونه کسیو سایلنت کنه ولی ناظم ها میتونند فرد را از سایلنتی در بیاورند

🌟(لیست ممنوع)🌟
نمایش لیست افراد سایلنت شده

🌟(حذف)[قوانین][توضیحات][ مدیران][لیست ممنوع]🌟
پاک کردن لیست ناظم ها یا مدیران-توضیحات-لیست سایلنت شده ها یا لیست ممنوع-قوانین


🌟(عمومی) [yes|no]🌟
نمایش گروه شما در لیست گروها
فقط برای ادمین ها و سودو ها

🌟(ایدی) [یوزرنیم]🌟
گرفتن اطلاعت یوزر نیم داده شد

🌟!log🌟
برگرداندن تاریخچه گروه در یک فایل متنی
🔴🔵🔴🔵🔴🔵🔴🔵🔴🔵🔴🔵
نیازی نیست از اسلش/مربع/علامت تعجب در اول دستورات استفاده کنید
💗💗💗💗💗💗💗💗💗💗💗💗
فقط ادمین ها میتونن اعضا به گروه ادد کنند در سوپر گروه(قانون تلگرام)
💗💗💗💗💗💗💗💗💗💗💗💗
فقط ناظم ها و خریدار ها میتوانند دستورات  بالا را اجرا کنند
💗💗💗💗💗💗💗💗💗💗💗💗
فقط خریدار گروه میتواند دستورات بالا رو اجرا کند
💗💗💗💗💗💗💗💗💗💗💗💗
➿➿➿➿➿➿➿➿➿➿➿➿ 
 
 ]]
 
 local owner = [[
 
🌟لیست دستورات سوپر گروه🌟:
➰شما مالک گروه هستید➰

💗(اینفو)💗
نمایش اطلاعات اصلی گروه

💗(ادمین ها)💗
نمایش لیست ادمین های گروه

💗(مالک)💗
نمایش خریدار گروه

💗(لیست مدیران)💗
نمایش لیست ناظم ها

💗(ربات ها)💗
لیست روبات های گروه

💗(ایدی افراد)💗
لیست اعضای گروه در یک فایل متنی

💗(بلاک)💗
بلاک کردن و کیک کردن فرد

🌠(ای دی)🌠
نمایش ایدی گروه
شما همچنین میتوانید هم با (یوزرنیم)و هم با (ریپلای پیام) ایدی عددی شخصی را بگیرید

💞(ایدی این)💞
نمایش اطلاعات فردی که پیغام رو فوارد کرده

💞(خروج)💞
اخراج شدن از سوپر گروه

💞(تنظیم مالک)💞
تنظیم کردن کاربر به عنوان خریدار گروه

🔴(ترفیع) [یوزرنیم][ریپلای پیام][ایدی]
🔵اضافه کردن کاربر به لیست ناظم ها

🔵(تنزل)[یوزرنیم][ایدی]🔴
پاک کردن کاربر از لیست ناظم ها

🔵(تنظیم نام)🔴
گذاشتن اسم گروه

🔴(تنظیم عکس)🔵
گذاشتن عکس برای گروه

🔴(تنظیم قوانین)🔵
گذاشتن قوانین برای گروه

🔴(تنظیم توضیحات)🔵
گذاشتن متن درباره برای سوپر گروه(این متن در بخش توضیحات گروه هم نمایش داده میشه)

🔴(ذخیره)[متن]🔵
ذخیره کردن یک متن

🔴(گرفتن)[متن]🔵
گرفتن متن

🔴(لینک جدید)🔵
ساختن لینک جدید

🔵(لینک)🔴
گرفتن لینک

🔵(قوانین)🔴
نمایش قوانین

🔴(تبدیل) ff🔵
تبدیل حروف با کلمه انگلیسی به عکس

💠قفل [لینک][اتک][اسپم][عربی][ورود][rtl][استیکر][محکم]💠

قفل کردن لینک گروها-اسپم-متن و اسم های بزرگ -زبان فارسی-تعداد اعضا-کاراکتر های غیر عادی-استیکر-مخاطبین
دقت کنید اگر گذینه اخری محکم روشن باشد کاربر از گروه کیک میشود و پیغام پاک میشه در غیر این صورت فقط پیغام پاک میشود

💠بازکردن [لینک][اتک][اسپم][عربی][ورود][rtl][استیکر][محکم]💠

باز کردن قفل امکانات بالا

💠(بستن)[اهنگ][عکس][گیف][ویدیو][فایل][چت]💠
پاک کردن سریع همه پیغام هایا چت ها-عکس ها-گیف ها-صدا های ضبط شده و موزیک-ویدیو

💠(ازاد کردن)[اهنگ][عکس][گیف][ویدیو][فایل][چت]💠
باز کردن قفل امکانات بالا

💠(حساسیت)[1_40]💠
گذاشتن value به عنوان حساسیت اسپم

🌟(تنظیمات)🌟
نمایش تنظیمات گروه

🌟(لیست ممنوع)🌟
نمایش نوع پیغام های سایلنت شده

🌟(ممنوع چت) [یورزنیم]🌟
سایلنت کردن یک کاربر خاص در گروه
فقط خریدار میتونه کسیو سایلنت کنه ولی ناظم ها میتونند فرد را از سایلنتی در بیاورند

🌟(لیست ممنوع)🌟
نمایش لیست افراد سایلنت شده

🌟(حذف)[قوانین][توضیحات][ مدیران][لیست ممنوع]🌟
پاک کردن لیست ناظم ها یا مدیران-توضیحات-لیست سایلنت شده ها یا لیست ممنوع-قوانین


🌟(عمومی) [yes|no]🌟
نمایش گروه شما در لیست گروها
فقط برای ادمین ها و سودو ها

🌟(ایدی) [یوزرنیم]🌟
گرفتن اطلاعت یوزر نیم داده شد

🌟!log🌟
برگرداندن تاریخچه گروه در یک فایل متنی
🔴🔵🔴🔵🔴🔵🔴🔵🔴🔵🔴🔵
نیازی نیست از اسلش/مربع/علامت تعجب در اول دستورات استفاده کنید
💗💗💗💗💗💗💗💗💗💗💗💗
فقط ادمین ها میتونن اعضا به گروه ادد کنند در سوپر گروه(قانون تلگرام)
💗💗💗💗💗💗💗💗💗💗💗💗
فقط ناظم ها و خریدار ها میتوانند دستورات  بالا را اجرا کنند
💗💗💗💗💗💗💗💗💗💗💗💗
فقط خریدار گروه میتواند دستورات بالا رو اجرا کند
💗💗💗💗💗💗💗💗💗💗💗💗
➿➿➿➿➿➿➿➿➿➿➿➿
    
 ]]
 
 local member = [[
 
💠شما یک عضو عادی هستید💠

ممه) دریافت عکس ممه)
〰〰〰〰〰〰〰〰
کون) دریفات عکس کون)
〰〰〰〰〰〰〰〰
(تبدیل) fff 
تبدیل کلمه انگلیسی به عکس
〰〰〰〰〰〰〰〰
زمان) تهران)
زمان   استان ها
〰〰〰〰〰〰
!voc ffff
تبدیل کلمه یا حرف انگلیسی به صدا
〰〰〰〰〰〰〰〰〰〰〰〰〰
google متن
سرچ کردن در گوگل
〰〰〰〰〰〰〰
!webshot http://سایت
عکس گرفتن از سایت 
〰〰〰〰〰〰〰
لیست مدیران
نمایش کمک مالک 
〰〰〰〰〰〰
قوانین
نمایش قوانین گروه
➿➿➿➿➿➿
 ]]
 
 local sudo = [[
 
🌟لیست دستورات سوپر گروه🌟:
👑شما سازنده ربات هستید👑

💗(اینفو)💗
نمایش اطلاعات اصلی گروه

💗(ادمین ها)💗
نمایش لیست ادمین های گروه

💗(مالک)💗
نمایش خریدار گروه

💗(لیست مدیران)💗
نمایش لیست ناظم ها

💗(ربات ها)💗
لیست روبات های گروه

💗(ایدی افراد)💗
لیست اعضای گروه در یک فایل متنی

💗(بلاک)💗
بلاک کردن و کیک کردن فرد

🌠(ای دی)🌠
نمایش ایدی گروه
شما همچنین میتوانید هم با (یوزرنیم)و هم با (ریپلای پیام) ایدی عددی شخصی را بگیرید

💞(ایدی این)💞
نمایش اطلاعات فردی که پیغام رو فوارد کرده

💞(خروج)💞
اخراج شدن از سوپر گروه

💞(تنظیم مالک)💞
تنظیم کردن کاربر به عنوان خریدار گروه

🔴(ترفیع) [یوزرنیم][ریپلای پیام][ایدی]
🔵اضافه کردن کاربر به لیست ناظم ها

🔵(تنزل)[یوزرنیم][ایدی]🔴
پاک کردن کاربر از لیست ناظم ها

🔵(تنظیم نام)🔴
گذاشتن اسم گروه

🔴(تنظیم عکس)🔵
گذاشتن عکس برای گروه

🔴(تنظیم قوانین)🔵
گذاشتن قوانین برای گروه

🔴(تنظیم توضیحات)🔵
گذاشتن متن درباره برای سوپر گروه(این متن در بخش توضیحات گروه هم نمایش داده میشه)

🔴(ذخیره)[متن]🔵
ذخیره کردن یک متن

🔴(گرفتن)[متن]🔵
گرفتن متن

🔴(لینک جدید)🔵
ساختن لینک جدید

🔵(لینک)🔴
گرفتن لینک

🔵(قوانین)🔴
نمایش قوانین

🔴(تبدیل) ff🔵
تبدیل حروف با کلمه انگلیسی به عکس

💠قفل [لینک][اتک][اسپم][عربی][ورود][rtl][استیکر][محکم]💠

قفل کردن لینک گروها-اسپم-متن و اسم های بزرگ -زبان فارسی-تعداد اعضا-کاراکتر های غیر عادی-استیکر-مخاطبین
دقت کنید اگر گذینه اخری محکم روشن باشد کاربر از گروه کیک میشود و پیغام پاک میشه در غیر این صورت فقط پیغام پاک میشود

💠بازکردن [لینک][اتک][اسپم][عربی][ورود][rtl][استیکر][محکم]💠

باز کردن قفل امکانات بالا

💠(بستن)[اهنگ][عکس][گیف][ویدیو][فایل][چت]💠
پاک کردن سریع همه پیغام هایا چت ها-عکس ها-گیف ها-صدا های ضبط شده و موزیک-ویدیو

💠(ازاد کردن)[اهنگ][عکس][گیف][ویدیو][فایل][چت]💠
باز کردن قفل امکانات بالا

💠(حساسیت)[1_40]💠
گذاشتن value به عنوان حساسیت اسپم

🌟(تنظیمات)🌟
نمایش تنظیمات گروه

🌟(لیست ممنوع)🌟
نمایش نوع پیغام های سایلنت شده

🌟(ممنوع چت) [یورزنیم]🌟
سایلنت کردن یک کاربر خاص در گروه
فقط خریدار میتونه کسیو سایلنت کنه ولی ناظم ها میتونند فرد را از سایلنتی در بیاورند

🌟(لیست ممنوع)🌟
نمایش لیست افراد سایلنت شده

🌟(حذف)[قوانین][توضیحات][ مدیران][لیست ممنوع]🌟
پاک کردن لیست ناظم ها یا مدیران-توضیحات-لیست سایلنت شده ها یا لیست ممنوع-قوانین


🌟(عمومی) [yes|no]🌟
نمایش گروه شما در لیست گروها
فقط برای ادمین ها و سودو ها

🌟(ایدی) [یوزرنیم]🌟
گرفتن اطلاعت یوزر نیم داده شد

🌟!log🌟
برگرداندن تاریخچه گروه در یک فایل متنی
🔴🔵🔴🔵🔴🔵🔴🔵🔴🔵🔴🔵
نیازی نیست از اسلش/مربع/علامت تعجب در اول دستورات استفاده کنید
💗💗💗💗💗💗💗💗💗💗💗💗
فقط ادمین ها میتونن اعضا به گروه ادد کنند در سوپر گروه(قانون تلگرام)
💗💗💗💗💗💗💗💗💗💗💗💗
فقط ناظم ها و خریدار ها میتوانند دستورات  بالا را اجرا کنند
💗💗💗💗💗💗💗💗💗💗💗💗
فقط خریدار گروه میتواند دستورات بالا رو اجرا کند
💗💗💗💗💗💗💗💗💗💗💗💗
➿➿➿➿➿➿➿➿➿➿➿➿ 

 ]]
 
 if msg.to.type == 'chat' and matches[1]:lower() == 'help' and matches[2] == nil then 
     
    if is_sudo(msg) then 
        return sudo
    elseif is_admin(msg) then 
        return admin 
    elseif is_owner(msg) then 
        return owner
    elseif is_momod(msg) then 
         return mods
    else 
        return member
        end
end
 if msg.to.type == 'chat' and matches[1]:lower() == 'help' and matches[2]:lower() == 'owner' then 
     if is_owner(msg) then 
         return owner
    else return 'Only Admins or higher can See this !'
    end 
end

 if msg.to.type == 'chat' and matches[1]:lower() == 'help' and matches[2]:lower() == 'mod' then
     if is_momod(msg) then 
         return mods
    else return 'only Owners Or higher Can See this !'
    end 
end 

 if msg.to.type == 'chat' and matches[1]:lower() == 'help' and matches[2]:lower() == 'member' then
         return member
    end 
end

    
return {
 
  patterns = {
    "^(راهنما)$",
	"^(راهنما)$",
	"^(راهنما)$",
	
	"^(help) (mod)$",
	"^(help) (owner)$",
	"^(help) (member)$",
  }, 
  run = run 
}

end




--  -_-_-_-_-_-_-_-_-_-   ||-_-_-_-_-_   ||             ||-_-_-_-_-_
--           ||           ||             ||             ||
--           ||           ||             ||             ||
--           ||           ||             ||             ||
--           ||           ||-_-_-_-_-_   ||             ||-_-_-_-_-_
--           ||           ||             ||             ||
--           ||           ||             ||             ||
--           ||           ||             ||             ||
--           ||           ||-_-_-_-_-_   ||-_-_-_-_-_   ||-_-_-_-_-_
--
--
--                               /\                              /\             /-_-_-_-_-_    ||-_-_-_-_-_   ||-_-_-_-_-_
--  ||\\            //||        //\\        ||      //||        //\\           //              ||             ||         //
--  || \\          // ||       //  \\       ||     // ||       //  \\         //               ||             ||       //
--  ||  \\        //  ||      //    \\      ||    //  ||      //    \\       ||                ||             ||    //
--  ||   \\      //   ||     //______\\     ||   //   ||     //______\\      ||      -_-_-_-   ||-_-_-_-_-_   || //
--  ||    \\    //    ||    //        \\    ||  //    ||    //        \\     ||           ||   ||             ||  \\ 
--  ||     \\  //     ||   //          \\   || //     ||   //          \\     \\          ||   ||             ||     \\
--  ||      \\//      ||  //            \\  ||//      ||  //            \\     \\-_-_-_-_-||   ||-_-_-_-_-_   ||        \\
--
--
--  ||-_-_-_-    ||           ||           ||               //-_-_-_-_-_-
--  ||     ||    ||           ||           ||              //
--  ||_-_-_||    ||           ||           ||             //
--  ||           ||           ||           ||             \\
--  ||           ||           \\           //              \\
--  ||           ||            \\         //               //
--  ||           ||-_-_-_-_     \\-_-_-_-//    -_-_-_-_-_-//
--
--By @ali_ghoghnoos
--@telemanager_ch
